In [7]:
#Dependencies
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd
from pathlib import Path
import scipy.stats as st

In [10]:
# Store file path in a variable
data_file1 = Path("Resources\AAPL_Hdata_5yr.csv")
data_file2 = Path("Resources\CSCO_HDATA_5yr.csv")
data_file3 = Path("Resources\HistoricalData5yr_SBUX.csv")
data_file4 = Path("Resources\MSFT_HData_5yr.csv")
data_file5 = Path("Resources\TSLA_HData_5yr.csv")

<>:2: SyntaxWarning: invalid escape sequence '\A'
<>:3: SyntaxWarning: invalid escape sequence '\C'
<>:4: SyntaxWarning: invalid escape sequence '\H'
<>:5: SyntaxWarning: invalid escape sequence '\M'
<>:6: SyntaxWarning: invalid escape sequence '\T'
<>:2: SyntaxWarning: invalid escape sequence '\A'
<>:3: SyntaxWarning: invalid escape sequence '\C'
<>:4: SyntaxWarning: invalid escape sequence '\H'
<>:5: SyntaxWarning: invalid escape sequence '\M'
<>:6: SyntaxWarning: invalid escape sequence '\T'
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:2: SyntaxWarning: invalid escape sequence '\A'
  data_file1 = Path("Resources\AAPL_Hdata_5yr.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:3: SyntaxWarning: invalid escape sequence '\C'
  data_file2 = Path("Resources\CSCO_HDATA_5yr.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:4: SyntaxWarning: invalid escape sequence '\H'
  data_file3 = Path("Resources\HistoricalData5yr_SBUX.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:5: SyntaxWarning: invalid escape sequence '\M'
  data_file4 = Path("Resources\MSFT_HData_5yr.csv")
C:\Users\Diana\AppData\Local\Temp\ipykernel_26940\3595181498.py:6: SyntaxWarning: invalid escape sequence '\T'
  data_file5 = Path("Resources\TSLA_HData_5yr.csv")

In [15]:
# Import the csv as a data frame
History1= pd.read_csv(data_file1, encoding="ISO-8859-1")
History2 = pd.read_csv(data_file2, encoding="ISO-8859-1")
History3 = pd.read_csv(data_file3)
History4 = pd.read_csv(data_file4)
History5 = pd.read_csv(data_file5)

History1.head()
History2.head()
History3.head()
History4.head()
History5.head()

   Name     Date Close/Last     Volume      Open      High       Low
0  TSLA  12/8/23   $243.84   103126800  $240.27   $245.27   $239.27
1  TSLA  12/7/23   $242.64   107142300  $241.55   $244.08   $236.98
2  TSLA  12/6/23   $239.37   126436200  $242.92   $246.57   $239.17
3  TSLA  12/5/23   $238.72   137971100  $233.87   $246.66   $233.70
4  TSLA  12/4/23   $235.58   104099800  $235.75   $239.37   $233.29

In [32]:
# Selected only relevant columns for merge
Test1 = History1[["Name","Date","Volume","Open","High","Low"]]

In [49]:
# Merge the two datasets by the values in the music_snapshot dataset
History_1and2_merged_df = pd.merge(History2, Test1, how="left")
History_1and2_merged_df

      Name        Date Close/Last    Volume     Open     High      Low
0     CSCO   12/8/2023    $48.38   16039940  $48.28   $48.59   $48.21
1     CSCO   12/7/2023    $48.26   20478480  $47.91   $48.36   $47.80
2     CSCO   12/6/2023    $47.70   19535530  $48.07   $48.21   $47.65
3     CSCO   12/5/2023    $47.93   20985040  $47.75   $47.96   $47.59
4     CSCO   12/4/2023    $48.05   17812930  $48.06   $48.18   $47.78
...    ...         ...        ...       ...      ...      ...      ...
1253  CSCO  12/17/2018    $44.20   35666160  $45.82   $45.99   $43.91
1254  CSCO  12/14/2018    $45.82   27359450  $46.37   $46.62   $45.64
1255  CSCO  12/13/2018    $47.47   19940510  $47.68   $47.97   $47.13
1256  CSCO  12/12/2018    $47.42   23144050  $47.92   $48.20   $47.36
1257  CSCO  12/11/2018    $47.09   25063320  $47.86   $47.90   $46.71

[1258 rows x 7 columns]

In [50]:
# Selected only relevant columns for merge
Test2 = History3[["Name","Date","Volume","Open","High","Low"]]

In [51]:
#merging history 3 and history 4
History_3and4_merged_df = pd.merge(History4,Test2 , how="left")
History_3and4_merged_df

      Name      Date Close/Last    Volume      Open      High       Low
0     MSFT   12/8/23   $374.23   20154370  $369.20   $374.46   $368.23
1     MSFT   12/7/23   $370.95   23118860  $368.23   $371.45   $366.32
2     MSFT   12/6/23   $368.80   21182070  $373.54   $374.18   $368.03
3     MSFT   12/5/23   $372.52   23065040  $366.45   $373.08   $365.62
4     MSFT   12/4/23   $369.14   32063310  $369.10   $369.52   $362.90
...    ...       ...        ...       ...       ...       ...       ...
1253  MSFT  12/17/18   $102.89   56837160  $105.41   $105.80   $101.71
1254  MSFT  12/14/18   $106.03   46961130  $108.25   $109.26   $105.50
1255  MSFT  12/13/18   $109.45   30600890  $109.58   $110.87   $108.63
1256  MSFT  12/12/18   $109.08   36169700  $110.89   $111.27   $109.04
1257  MSFT  12/11/18   $108.59   42342240  $109.80   $110.95   $107.44

[1258 rows x 7 columns]

In [52]:
merging_3_4_5 = pd.merge(History5, History_3and4_merged_df, how="left" )

merging_3_4_5

      Name      Date Close/Last     Volume      Open      High       Low
0     TSLA   12/8/23   $243.84   103126800  $240.27   $245.27   $239.27
1     TSLA   12/7/23   $242.64   107142300  $241.55   $244.08   $236.98
2     TSLA   12/6/23   $239.37   126436200  $242.92   $246.57   $239.17
3     TSLA   12/5/23   $238.72   137971100  $233.87   $246.66   $233.70
4     TSLA   12/4/23   $235.58   104099800  $235.75   $239.37   $233.29
...    ...       ...        ...        ...       ...       ...       ...
1253  TSLA  12/17/18    $23.23   114972423   $24.13    $24.38    $22.93
1254  TSLA  12/14/18    $24.38    94914328   $25.00    $25.19    $24.29
1255  TSLA  12/13/18    $25.12   110222465   $24.68    $25.16    $24.45
1256  TSLA  12/12/18    $24.44    75295837   $24.63    $24.79    $24.34
1257  TSLA  12/11/18    $24.45    94477033   $24.66    $24.81    $24.02

[1258 rows x 7 columns]

In [53]:
new_merged_df = pd.merge(History_1and2_merged_df, merging_3_4_5, how = "left")

new_merged_df

      Name        Date Close/Last    Volume     Open     High      Low
0     CSCO   12/8/2023    $48.38   16039940  $48.28   $48.59   $48.21
1     CSCO   12/7/2023    $48.26   20478480  $47.91   $48.36   $47.80
2     CSCO   12/6/2023    $47.70   19535530  $48.07   $48.21   $47.65
3     CSCO   12/5/2023    $47.93   20985040  $47.75   $47.96   $47.59
4     CSCO   12/4/2023    $48.05   17812930  $48.06   $48.18   $47.78
...    ...         ...        ...       ...      ...      ...      ...
1253  CSCO  12/17/2018    $44.20   35666160  $45.82   $45.99   $43.91
1254  CSCO  12/14/2018    $45.82   27359450  $46.37   $46.62   $45.64
1255  CSCO  12/13/2018    $47.47   19940510  $47.68   $47.97   $47.13
1256  CSCO  12/12/2018    $47.42   23144050  $47.92   $48.20   $47.36
1257  CSCO  12/11/2018    $47.09   25063320  $47.86   $47.90   $46.71

[1258 rows x 7 columns]

In [ ]:
new_merged_df.to_csv('merged_data_1.csv', index=False)